Revit 2025 API
EnergyAnalysisOpening.GetPolyloop Method
 Gets the planar polygon describing the opening geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public Polyloop GetPolyloop()
Public Function GetPolyloop As Polyloop
public:
Polyloop^ GetPolyloop()
member GetPolyloop : unit -> Polyloop
Return Value
Polyloop
Remarks
 A planar polygon describing the surface geometry as described in gbXML. The geometry is currently measured per analytical(center-line).
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace